/*Напишите программу, которая на вход принимает
число и выдает его квадрат (число умноженное
на само себя)*/

Console.Write("Введи целое число: ");
int number = int.Parse(Console.ReadLine());
int result = number * number;
Console.WriteLine($"Квадрат входного числа = {result}");







